In [1]:
import pandas as pd
import numpy as np
dict={'first score':[100,90,np.nan,95],
      'second score':[30,45,56,np.nan],
      'third score':[np.nan,40,80,98]}

In [2]:
df=pd.DataFrame(dict)
df.head()

   first score  second score  third score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2          NaN          56.0         80.0
3         95.0           NaN         98.0

In [3]:
df.isnull()

   first score  second score  third score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False

In [4]:
df.notnull()

   first score  second score  third score
0         True          True        False
1         True          True         True
2        False          True         True
3         True         False         True

In [5]:
#df=pd.DataFrame(dict)
df.fillna(0)

   first score  second score  third score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

In [6]:
df.fillna(method='pad')

   first score  second score  third score
0        100.0          30.0          NaN
1         90.0          45.0         40.0
2         90.0          56.0         80.0
3         95.0          56.0         98.0

In [7]:
df.fillna(method='bfill')

   first score  second score  third score
0        100.0          30.0         40.0
1         90.0          45.0         40.0
2         95.0          56.0         80.0
3         95.0           NaN         98.0

In [8]:
df.replace(to_replace=np.nan,value=-99)

   first score  second score  third score
0        100.0          30.0        -99.0
1         90.0          45.0         40.0
2        -99.0          56.0         80.0
3         95.0         -99.0         98.0

In [9]:
df.dropna()

   first score  second score  third score
1         90.0          45.0         40.0

In [10]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [14]:
new_data=df.dropna(axis=0)
new_data

   first score  second score  third score
1         90.0          45.0         40.0